app/controllers/application_controller.rb

    def logged_in?


        headers = request.headers["Authorization"]
        token = headers.split(" ")[1]

        begin
            user_id = JWT.decode(token, "softwaredeveloper")[0]["user_id"]
            @user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]