app/controllers/appointments_controller.rb

    def index
        appointments = Appointment.all
---
SELECT "appointments".* FROM "appointments"

    def create
        # byebug
        appointment_params[:user_id] = @user.id
        skill_id = Skill.find_by("title": params["skill_title"]).id

        appointment_params[:skill_id] = skill_id
        appointment = Appointment.create!(appointment_params)
---
SELECT "skills".* FROM "skills" WHERE "skills"."title" = ? LIMIT ?  [["title", "Basics of Redux"], ["LIMIT", 1]]
INSERT INTO "appointments" ("user_id", "skill_id", "created_at", "updated_at", "start_date", "completion_date", "max_partners") VALUES (?, ?, ?, ?, ?, ?, ?)

    def show

            appointment = Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]