app/controllers/posts_controller.rb

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]
---
    def destroy
        # byebug
        if @user
        post = Post.find(params[:id])
        post.destroy