app/controllers/posts_controller.rb

    def create
        # byebug
        post_params[:user_id] = @user.id
        post_params[:resolved?] = false
        post_params[:likes] = 0
        # byebug
        post = Post.create(post_params)
---
INSERT INTO "posts" ("user_id", "content", "resolved?", "likes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 6], ["content", "this is a new post"], ["resolved?", 0], ["likes", 0], ["created_at", "2020-07-21 19:49:40.799534"], ["updated_at", "2020-07-21 19:49:40.799534"]]

    def show
        # byebug
        if @user
        post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def like
        if @user
        post = Post.find(params[:id])
        post.likes += 1
        # post['resolved?'] = !post['resolved?']   # both resolved and likes are firing
        # byebug
        post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "likes" = ?, "resolved?" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["likes", 23], ["resolved?", 1], ["updated_at", "2020-07-23 07:02:54.797063"], ["id", 2]]

    def resolve
        if @user
            post = Post.find(params[:id])
        end

        if post['resolved?'] == false
            post['resolved?'] = true
        else
            post['resolved?'] = true

        end
        post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "resolved?" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["resolved?", 1], ["updated_at", "2020-07-23 19:31:01.046003"], ["id", 19]]

    def destroy
        # byebug
        if @user
        post = Post.find(params[:id])
        post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]