app/controllers/skills_controller.rb

    def index
        skills = Skill.all
---
SELECT "skills".* FROM "skills"

    def create
        # byebug
        skill = Skill.create!(skill_params)
---
INSERT INTO "skills" ("title", "created_at", "updated_at", "about", "resources") VALUES (?, ?, ?, ?, ?)  [["title", "new"], ["created_at", "2020-07-17 18:15:13.213292"], ["updated_at", "2020-07-17 18:15:13.213292"], ["about", "fred"], ["resources", "bgt"]]