app/controllers/users_controller.rb

    def create
        # byebug
        user = User.new(user_params)

        if user.valid?
            user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password_digest") VALUES (?, ?, ?, ?)